#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GunfireRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GunfireRuntime_structs.hpp"
#include "Slate_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CinematicCamera_classes.hpp"
#include "NavigationSystem_classes.hpp"
#include "NiagaraAnimNotifies_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "PhysicsCore_structs.hpp"
#include "GunfireTechRequirements_structs.hpp"
#include "InputCore_structs.hpp"
#include "MovieScene_structs.hpp"
#include "MovieScene_classes.hpp"
#include "MovieSceneTracks_structs.hpp"
#include "MovieSceneTracks_classes.hpp"
#include "Gauntlet_classes.hpp"
#include "GunfireOnlineModule_structs.hpp"


namespace SDK
{

// Class GunfireRuntime.ActorModifier
// 0x00D0 (0x00F8 - 0x0028)
class UActorModifier : public UObject
{
public:
	class FName                                   NameID;                                            // 0x0028(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Category;                                          // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EActorModifierScope                           Scope;                                             // 0x0038(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    Stats;                                             // 0x0040(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           Tags;                                              // 0x0050(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	int32                                         Level;                                             // 0x0060(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Label;                                             // 0x0068(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                   SubLabel;                                          // 0x0080(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                   Description;                                       // 0x0098(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                   FlavorText;                                        // 0x00B0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class FName>                           DisplayTags;                                       // 0x00C8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UTexture2D*                             Icon;                                              // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStatInfoSet*                           InspectStats;                                      // 0x00E0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Owner;                                             // 0x00E8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStatsComponent*                        StatsComponent;                                    // 0x00F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void ComputeDerivedStats();
	void ComputeStats();
	void FilterIncomingDamage(struct FDamageInfo& DamageInfo, float* DamageOut, bool* ShouldApplyDamage);
	void FilterIncomingFallDamage(const float& Damage, float* DamageInfoOut, bool* ShouldApplyDamage);
	void FilterIncomingHealing(struct FHealingInfo& HealingInfo, float* HealingOut, bool* ShouldApplyHealing);
	class FString GetDebugText();
	struct FInspectInfo GetInspectInfo(class AActor* Actor, int32 InspectLevel);
	float GetStat(class FName Stat);
	void ModifyDamage(struct FDamageInfo& Info);
	void ModifyHealing(struct FHealingInfo& Info);
	void ModifyIncomingDamage(struct FDamageInfo& Info);
	void ModifyIncomingHealing(struct FHealingInfo& Info);
	void ModifyInspectInfo(class AActor* Actor, int32 InspectLevel, struct FInspectInfo& Info, bool* Rtn);
	void ModifyStat(class FName Stat, float Value);
	void NotifyHitTarget(const struct FDamageInfo& DamageInfo);
	void NotifyTakeDamage(const struct FDamageInfo& DamageInfo);
	void OnAdded();
	void OnComputeDerivedStats();
	void OnComputeStats();
	void OnEquipped();
	void OnHitTarget(const struct FDamageInfo& DamageInfo);
	void OnLevelChanged();
	void OnPostComputeStats();
	void OnRep_Level();
	void OnTakeDamage(const struct FDamageInfo& DamageInfo);
	void OnTick(float DeltaSeconds);
	void OnUnequipped();
	void PostComputeStats();
	void ScaleStat(class FName Stat, float Scalar, bool AutoInitValue);
	void SetLevel(int32 NewLevel);
	void SetOwner(class AActor* NewOwner);

	class AActor* GetOwner() const;
	class ACharacter* GetOwningCharacter() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ActorModifier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ActorModifier")
	}
	static class UActorModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorModifier>();
	}
};
DUMPER7_ASSERTS_UActorModifier;

// Class GunfireRuntime.Item
// 0x0248 (0x04D8 - 0x0290)
class AItem : public AActor
{
public:
	uint8                                         Pad_290[0x10];                                     // 0x0290(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UPersistenceComponent*                  PersistenceComp;                                   // 0x02A0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UItemType>                  Type;                                              // 0x02A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, AssetRegistrySearchable, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UItemCategory>              Category;                                          // 0x02B0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           FilterTags;                                        // 0x02B8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	int32                                         MaxStackCount;                                     // 0x02C8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BaseMaxQuantity;                                   // 0x02CC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStatValue                             MaxQuantityBonusStat;                              // 0x02D0(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FStatValue                             MaxQuantityMultiplierStat;                         // 0x02DC(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          KeepInInventoryWithNoQuantity;                     // 0x02E8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemInstanceData*                      InstanceData;                                      // 0x02F0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, InstancedReference, SaveGame, RepNotify, NoDestructor, AdvancedDisplay, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                    Stats;                                             // 0x02F8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          Unique;                                            // 0x0308(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNeedsQuantityToSelect;                            // 0x0309(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30A[0x6];                                      // 0x030A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Label;                                             // 0x0310(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                   SubLabel;                                          // 0x0328(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                   Description;                                       // 0x0340(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                   PickupDescription;                                 // 0x0358(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                   FlavorText;                                        // 0x0370(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UTexture2D*                             Icon;                                              // 0x0388(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              LargeIcon;                                         // 0x0390(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             HUDIcon;                                           // 0x03C0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   InspectActor;                                      // 0x03C8(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Interactable;                                      // 0x03F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseInteractInfo;                                   // 0x03F9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3FA[0x6];                                      // 0x03FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   InteractLabel;                                     // 0x0400(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FName                                   InteractIconName;                                  // 0x0418(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             InteractIcon;                                      // 0x0420(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoundGunfire                          PickupSound;                                       // 0x0428(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PickupChanceApplyModStatName;                      // 0x0430(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PickupModStatName;                                 // 0x0438(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PickupScalarStatName;                              // 0x0440(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   LootFxAttachNode;                                  // 0x0448(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraSystem*                         LootFxOverride;                                    // 0x0450(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DoBounce;                                          // 0x0458(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_459[0x3];                                      // 0x0459(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   BounceAnimRoot;                                    // 0x045C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_464[0x4];                                      // 0x0464(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundGunfire                          BounceFlipSound;                                   // 0x0468(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoundGunfire                          BounceSound;                                       // 0x0470(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FImpactEffectSelector                  DroppedImpactEffect;                               // 0x0478(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	TSubclassOf<class UObject>                    RequiredAccountAward;                              // 0x0488(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UEntitlementType>           RequiredEntitlement;                               // 0x0490(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnGround;                                         // 0x0498(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_499[0x7];                                      // 0x0499(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UInventoryComponent* InventoryComponent)> OnCollected;       // 0x04A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UNiagaraComponent*                      LootFxParticles;                                   // 0x04B0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          Inspecting;                                        // 0x04B8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4B9[0xF];                                      // 0x04B9(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemSocketComponent*                   ItemSocket;                                        // 0x04C8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4D0[0x8];                                      // 0x04D0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Bounce();
	void DropBounce();
	void Fall(float MaxHeight);
	void FallTo(const struct FVector& NewLocation);
	struct FInspectInfo GetInspectInfo(class AActor* Actor, class UItemInstanceData* InInstanceData, int32 LevelOverride);
	int32 GetMaxQuantity(class AActor* Actor);
	int32 GetQuantity();
	void InitializeLootFxForLocalPawn(class APawn* Pawn);
	void LevelChanged(class UInventoryComponent* Inventory, int32 ItemId, class UItemInstanceData* ItemInstanceData);
	void ModifyInspectInfo(class AActor* Actor, class UItemInstanceData* InInstanceData, struct FInspectInfo& Info, bool* HideBaseStats);
	void OnCinematic(class APlayerControllerGunfire* Player, bool bIsInCinematicMode);
	void OnDropped();
	void OnPickedUp(class UInventoryComponent* Inventory);
	void OnPickupFailed();
	void OnRep_InstanceData(class UItemInstanceData* PrevData);
	void PickupItem(class UInventoryComponent* Inventory);
	bool PickupPreAdd(class UInventoryComponent* Inventory, int32& Quantity, int32 Level);
	bool PreAdd(class UInventoryComponent* Inventory, int32& Quantity);
	void SetFallLocation(const struct FVector& NewRootLocation, const struct FVector& NewRelativeLocation);
	void SetLevel(uint8 Level);
	void SetNewStatsHandle(const struct FDataTableRowHandle& InStatsHandle);
	void SetQuantity(int32 Quantity);
	void SetupItemInInventory(class UInventoryComponent* Inventory, const struct FInventoryItem& Item);
	bool ValidateAdd(class UInventoryComponent* Inventory, int32 DesiredQuantity, int32* AllowedQuantity);

	uint8 GetItemLevel() const;
	class UItemSocketComponent* GetItemSocket() const;
	class FText GetLabel() const;
	bool GetRewardForLowerQualityPickup(class UInventoryComponent* Inventory, int32 Level, TSubclassOf<class AItem>* OutRewardClass, int32* OutQuantity, int32* OutLevel) const;
	bool GetRewardForMaxStackPickup(class UInventoryComponent* Inventory, int32 Level, TSubclassOf<class AItem>* OutRewardClass, int32* OutQuantity, int32* OutLevel) const;
	class FText GetSubLabel() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Item")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Item")
	}
	static class AItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<AItem>();
	}
};
DUMPER7_ASSERTS_AItem;

// Class GunfireRuntime.Equipment
// 0x0190 (0x0668 - 0x04D8)
class AEquipment : public AItem
{
public:
	class FName                                   CustomizationID;                                   // 0x04D8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AnimationLayer;                                    // 0x04E0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FEquipmentAttachment>           Attachments;                                       // 0x04E8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          AutoEnableInput;                                   // 0x04F8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShouldUnequip;                                     // 0x04F9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseEquipmentAnimTimings;                           // 0x04FA(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          FallbackToCharacterTimings;                        // 0x04FB(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          StopAnimsRegardlessOfTimingTarget;                 // 0x04FC(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSupportSlaveAnimations;                           // 0x04FD(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4FE[0x2];                                      // 0x04FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FEquipmentModSlot>              ModSlots;                                          // 0x0500(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class FName>                           ActiveTags;                                        // 0x0510(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class FName>                           CharacterAnimTags;                                 // 0x0520(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FName                                   AdditionalAnimTag;                                 // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoundGunfire                          EquipSound;                                        // 0x0538(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FLoadableItemAsset>             EquipmentAssets;                                   // 0x0540(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UStatsComponent*                        StatsComp;                                         // 0x0550(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AEquipment* Equipment)> OnEquippedEvent;                     // 0x0558(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AEquipment* Equipment)> OnUnequippedEvent;                   // 0x0568(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AEquipment* Equipment)> OnEquipStateUpdated;                 // 0x0578(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AEquipment* Equipment, bool InHand)> OnInHandChangedEvent;   // 0x0588(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AEquipment* Equipment, class AEquipmentMod* Mod)> OnModAttached; // 0x0598(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AEquipment* Equipment, class AEquipmentMod* Mod)> OnModDetached; // 0x05A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_5B8[0x8];                                      // 0x05B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimationHandle                       CurrentAnimHandle;                                 // 0x05C0(0x0020)(BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_5E0[0x48];                                     // 0x05E0(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterGunfire*                      Character;                                         // 0x0628(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ACharacterGunfire*                      CharacterReplicated;                               // 0x0630(0x0008)(Net, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UAnimInstanceGunfire*>           AnimInstances;                                     // 0x0638(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class AEquipmentMod*>                  ModInstances;                                      // 0x0648(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UActorCustomizationComponent*           CustomizationComponent;                            // 0x0658(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         BitPad_660_0 : 4;                                  // 0x0660(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bIsActiveReplicated : 1;                           // 0x0660(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Net, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bIsInHandReplicated : 1;                           // 0x0660(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Net, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_661[0x7];                                      // 0x0661(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _NotifyHitTarget(const struct FDamageInfo& DamageInfo);
	void _NotifyTakeDamage(const struct FDamageInfo& DamageInfo);
	void Activate();
	void ComputeCharacterStats();
	void ComputeStats();
	void Deactivate();
	void Detach();
	class FName GetAnimationLayer();
	TArray<class AEquipmentMod*> GetAttachedMods();
	class AEquipmentMod* GetEquipmentMod(uint8 Slot);
	int32 GetEquipmentSlotIdx();
	int32 GetItemID();
	struct FEquipmentModSlot GetModSlotByNameID(class FName SlotNameID);
	uint8 GetModSlotIndexByNameID(class FName SlotNameID);
	void GetSlaveAnimLayerOverrideFor(class FName AnimationID, class FName& InOutLayer);
	float GetStat(class FName Stat);
	bool HasEquipmentAnimationEntry(class FName AnimationID, class FName AnimLayerOverride);
	void InstanceDataChanged();
	void ModifyStat(class FName Stat, float Value);
	void OnActivated();
	void OnAttachmentsUpdated();
	void OnComputeStats();
	void OnDeactivated();
	void OnDetached();
	void OnEquipmentAssetsLoaded();
	void OnEquipped();
	void OnFinishLoadingAssets();
	void OnHitTarget(const struct FDamageInfo& DamageInfo);
	void OnInHand();
	void OnNotInHand();
	void OnPostComputeStats();
	void OnSkeletalMeshAnimInitialized();
	void OnTakeDamage(const struct FDamageInfo& DamageInfo);
	void OnUnequipped();
	float PlayAnimation(class FName AnimationID, float PlayRate, bool bCharacterOnly, class FName AnimLayerOverride, int32 Seed, float StartTimeOverride);
	void PostComputeCharacterStats();
	void PostComputeStats();
	void PostSetupInventory();
	void ScaleStat(class FName Stat, float Scalar, bool AutoInitValue);
	void ServerSetInHand(bool InHand);
	void SetAttachmentsVisible(bool Visible);
	void SetInHand(bool InHand);
	void SetInputEnabled(bool Enabled);
	void Unequip();
	bool ValidateEquip(class ACharacterGunfire* ToCharacter);

	bool AreAssetsLoaded() const;
	class ACharacterGunfire* GetCharacter() const;
	class FName GetCurrentAnimation() const;
	class UObject* GetEquipmentAsset(class FName AssetName) const;
	class UClass* GetEquipmentAssetClass(class FName AssetName) const;
	class AUIHud* GetHud() const;
	class UInventoryComponent* GetInventoryComponent() const;
	bool IsActionAllowed() const;
	bool IsActive() const;
	bool IsEquipped() const;
	bool IsInHand() const;
	bool IsLocallyControlled() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Equipment")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Equipment")
	}
	static class AEquipment* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEquipment>();
	}
};
DUMPER7_ASSERTS_AEquipment;

// Class GunfireRuntime.WeaponBase
// 0x0050 (0x06B8 - 0x0668)
class AWeaponBase : public AEquipment
{
public:
	uint8                                         Pad_668[0x8];                                      // 0x0668(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UDamageTypeGunfire>         DamageType;                                        // 0x0670(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FImpactEffectDescriptor                ImpactEffect;                                      // 0x0678(0x0020)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FWeaponPhantomInfo& PhantomInfo)> OnWeaponPhantomBegin; // 0x0698(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AActor* Cause, TSubclassOf<class UDamageTypeGunfire> DamageType, class UPrimitiveComponent* InitialShape)> OnWeaponPhantomEnd; // 0x06A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	void ComputeDamage(class AActor* Actor, float* Damage, float* AttackRating);
	float GetAttackSpeed();
	const struct FImpactEffectDescriptor GetImpactEffect();

	bool AttemptProc(float BonusChance) const;
	float GetProcChance() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WeaponBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WeaponBase")
	}
	static class AWeaponBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWeaponBase>();
	}
};
DUMPER7_ASSERTS_AWeaponBase;

// Class GunfireRuntime.InheritableObject
// 0x0000 (0x0028 - 0x0028)
class UInheritableObject : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InheritableObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InheritableObject")
	}
	static class UInheritableObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInheritableObject>();
	}
};
DUMPER7_ASSERTS_UInheritableObject;

// Class GunfireRuntime.EditorTickableActor
// 0x0018 (0x02A8 - 0x0290)
class AEditorTickableActor final : public AActor
{
public:
	uint8                                         Pad_290[0x8];                                      // 0x0290(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          IsTickableInGame;                                  // 0x0298(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_299[0x3];                                      // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TickEditorInterval;                                // 0x029C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TickEditorDelta;                                   // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ReceiveTickEditor();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EditorTickableActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EditorTickableActor")
	}
	static class AEditorTickableActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEditorTickableActor>();
	}
};
DUMPER7_ASSERTS_AEditorTickableActor;

// Class GunfireRuntime.AchievementController
// 0x0070 (0x0098 - 0x0028)
class UAchievementController final : public UObject
{
public:
	uint8                                         Pad_28[0x70];                                      // 0x0028(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AchievementController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AchievementController")
	}
	static class UAchievementController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAchievementController>();
	}
};
DUMPER7_ASSERTS_UAchievementController;

// Class GunfireRuntime.SpawnTableEntry
// 0x0098 (0x00C0 - 0x0028)
class USpawnTableEntry : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ChanceGroup;                                       // 0x0030(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Chance;                                            // 0x0038(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           ChanceStats;                                       // 0x0040(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	int32                                         ChanceDecayBelowMinLevel;                          // 0x0050(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ChanceDecayAboveMaxLevel;                          // 0x0054(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ChanceIncreaseOnFail;                              // 0x0058(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           Tags;                                              // 0x0060(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class FName>                           RestrictedTags;                                    // 0x0070(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FConditions                            OwnerConditions;                                   // 0x0080(0x0018)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FConditions                            CauseConditions;                                   // 0x0098(0x0018)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                         LevelMin;                                          // 0x00B0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LevelMax;                                          // 0x00B4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RatingMin;                                         // 0x00B8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RatingMax;                                         // 0x00BC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static int32 ScaleSpawnQuantity(class UObject* WorldContextObject, int32 Quantity);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpawnTableEntry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpawnTableEntry")
	}
	static class USpawnTableEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpawnTableEntry>();
	}
};
DUMPER7_ASSERTS_USpawnTableEntry;

// Class GunfireRuntime.SpawnTableElement
// 0x0000 (0x00C0 - 0x00C0)
class USpawnTableElement : public USpawnTableEntry
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpawnTableElement")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpawnTableElement")
	}
	static class USpawnTableElement* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpawnTableElement>();
	}
};
DUMPER7_ASSERTS_USpawnTableElement;

// Class GunfireRuntime.ConditionalAnimNotify
// 0x0028 (0x0060 - 0x0038)
class UConditionalAnimNotify : public UAnimNotify
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	ENotifyOptimizationType                       OptimizationType;                                  // 0x0040(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShowInPreview;                                    // 0x0041(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FConditions                            Conditions;                                        // 0x0048(0x0018)(Edit, BlueprintReadOnly, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ConditionalAnimNotify")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConditionalAnimNotify")
	}
	static class UConditionalAnimNotify* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConditionalAnimNotify>();
	}
};
DUMPER7_ASSERTS_UConditionalAnimNotify;

// Class GunfireRuntime.AnimNotify_PlayActorCustomizationParticleEffect
// 0x0090 (0x00F0 - 0x0060)
class alignas(0x10) UAnimNotify_PlayActorCustomizationParticleEffect final : public UConditionalAnimNotify
{
public:
	TArray<struct FTagParticleEffectPair>         ParticleSystems;                                   // 0x0060(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FVector                                LocationOffset;                                    // 0x0070(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               RotationOffset;                                    // 0x0088(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Scale;                                             // 0x00A0(0x0018)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B8[0x28];                                      // 0x00B8(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         Attached : 1;                                      // 0x00E0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SocketName;                                        // 0x00E4(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotify_PlayActorCustomizationParticleEffect")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotify_PlayActorCustomizationParticleEffect")
	}
	static class UAnimNotify_PlayActorCustomizationParticleEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_PlayActorCustomizationParticleEffect>();
	}
};
DUMPER7_ASSERTS_UAnimNotify_PlayActorCustomizationParticleEffect;

// Class GunfireRuntime.InventoryComponent
// 0x01B0 (0x0250 - 0x00A0)
class UInventoryComponent : public UActorComponent
{
public:
	bool                                          IsMerchant;                                        // 0x00A0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInventoryAccess                              Accessibility;                                     // 0x00A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UItemType>                  EquipmentInHand;                                   // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UItemType>                  LastEquipmentInHand;                               // 0x00B0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AItem>                      CurrencyType;                                      // 0x00B8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AItem>                      MetalType;                                         // 0x00C0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraSystem*                         DefaultLootFX;                                     // 0x00C8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnInventoryChanged;                                // 0x00D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 ItemId)>  OnLeveledUp;                                       // 0x00E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(TSubclassOf<class AItem> ItemBP)> OnUsedItem;                      // 0x00F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(TSubclassOf<class AItem> ItemBP, int32 Quantity)> OnAddItem;       // 0x0100(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(TSubclassOf<class AItem> ItemBP, int32 Quantity, bool DidTransactionSucceed)> OnAttemptTakeItem; // 0x0110(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(TSubclassOf<class AItem> ItemBP, int32 Quantity, int32 Level, EItemNotifyReason Reason)> OnPickupItem; // 0x0120(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(TSubclassOf<class AItem> ItemBP, int32 Quantity, int32 Level, EItemNotifyReason Reason)> OnPickupItemServer; // 0x0130(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(TSubclassOf<class AItem> ItemBP, int32 Level)> OnUpgradeItem;      // 0x0140(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(TSubclassOf<class AItem> ItemBP)> OnInventoryFull;                 // 0x0150(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AEquipment* Equipment)> OnEquipmentActivated;                // 0x0160(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AEquipment* Equipment)> OnEquipmentDeactivated;              // 0x0170(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AEquipment* Equipment, int32 ItemId, int32 SlotIndex)> OnEquippedItem; // 0x0180(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AEquipment* Equipment, int32 ItemId, int32 SlotIndex)> OnUnequippedItem; // 0x0190(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(TSubclassOf<class UItemType> EquipmentInHand, TSubclassOf<class UItemType> Previous)> OnEquipmentInHand; // 0x01A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AEquipment* Equipment, class AEquipmentMod* Mod)> OnEquipmentModAttached; // 0x01B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AEquipment* Equipment, class AEquipmentMod* Mod)> OnEquipmentModDetached; // 0x01C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	int32                                         IDGen;                                             // 0x01D0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInventoryItem>                 Items;                                             // 0x01D8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, SaveGame, RepNotify, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<struct FEquipmentSlot>                 EquipmentSlots;                                    // 0x01E8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F8[0x10];                                     // 0x01F8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInventorySold>                 PriceScaling;                                      // 0x0208(0x0010)(Net, ZeroConstructor, SaveGame, Protected, NativeAccessSpecifierProtected)
	bool                                          DoPriceScaling;                                    // 0x0218(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_219[0x37];                                     // 0x0219(0x0037)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static TSoftClassPtr<class UClass> ActorToItem(TSoftClassPtr<class UClass> Item);
	static class UInventoryComponent* GetInventoryForItem(class AActor* Actor, TSubclassOf<class AItem> Item);
	static class UInventoryComponent* GetInventoryForItemSoft(class AActor* Actor, TSoftClassPtr<class UClass> Item);
	static class UInventoryComponent* GetInventoryForItemType(class AActor* Actor, TSubclassOf<class UItemType> ItemType);

	void AddInfiniteItem(TSubclassOf<class AItem> ItemBP);
	bool AutoEquipItem(TSubclassOf<class AItem> ItemBP, bool ForceEquip);
	bool AutoEquipItemByID(const int32 ItemId, bool ForceEquip);
	void AutoPickupAndEquipItem(class AItem* Item, bool InHand);
	bool CanAddItem(TSubclassOf<class AItem> ItemBP, int32 Quantity, int32 ItemLevel);
	bool CanAutoEquip(TSubclassOf<class AItem> ItemBP, bool ManualRequest);
	bool CanEquipItemByID(const int32 ItemId, const int32 SlotIndex);
	void ClientForceUseItem(int32 ItemId);
	void ClientNotifyInventoryFull(TSubclassOf<class AItem> ItemBP);
	void ClientNotifyPickupItem(TSubclassOf<class AItem> ItemBP, int32 Quantity, int32 Level, EItemNotifyReason Reason);
	void ClientNotifyPickupItemInstance(class AItem* Item, int32 Quantity, int32 Level, EItemNotifyReason Reason, bool bBroadcastNotify);
	void ClientNotifyTakeItemResult(TSubclassOf<class AItem> ItemBP, int32 Quantity, bool DidTakeItem);
	void ClientNotifyUpgradeItem(TSubclassOf<class AItem> ItemBP, int32 Level);
	int32 CountItemByType(TSubclassOf<class UItemType> ItemType);
	void DetachItemByID(const int32 ItemId);
	void DropAll();
	void DropItem(TSubclassOf<class AItem> ItemBP, int32 Quantity);
	void DropItemByID(const int32 ItemId, int32 Quantity, bool Force);
	bool EquipItem(TSubclassOf<class AItem> ItemBP, const int32 SlotIndex);
	bool EquipItemByID(const int32 ItemId, const int32 SlotIndex);
	bool EquipItemWithTransform(const int32 ItemId, const int32 SlotIndex, const struct FTransform& Transform);
	void EquipSkin(int32 ItemId, int32 SkinID);
	struct FInventoryItem FindItem(TSubclassOf<class AItem> ItemBP);
	struct FInventoryItem FindItemByEquipSlotNameID(class FName NameID);
	struct FInventoryItem FindItemByID(int32 ID);
	TSubclassOf<class UItemType> GetActivationTypeBySlotName(class FName NameID);
	int32 GetBuyValue(class UInventoryComponent* OtherInventory, int32 ItemId, int32 Level);
	int32 GetEquipmentItemID(class AEquipment* EquippedActor);
	struct FEquipmentSlot GetEquipmentSlotByNameID(class FName SlotNameID);
	int32 GetEquipmentSlotIndex(TSubclassOf<class AItem> ItemBP);
	int32 GetEquipmentSlotIndexByNameID(class FName SlotNameID);
	int32 GetEquipmentSlotIndexBySlotName(class FName SlotName);
	class FName GetEquipmentSlotNameForItem(TSubclassOf<class AItem> ItemBP);
	class AEquipment* GetEquippedItem(int32 SlotIndex);
	class AEquipment* GetEquippedItemBySlotName(class FName NameID);
	int32 GetItemCount();
	class UItemInstanceData* GetItemInstanceData(TSubclassOf<class AItem> ItemBP);
	TArray<struct FInventoryItem> GetItems();
	TSubclassOf<class UItemType> GetItemTypeBySlotName(class FName NameID);
	class AEquipment* GetNextActiveItem(TSubclassOf<class UItemType> Type);
	bool GetNextItem(int32 CurrentID, struct FInventoryItem* OutItem, TSubclassOf<class UItemType> Type, bool bWrapAround);
	bool GetPreviousItem(int32 CurrentID, struct FInventoryItem* OutItem, TSubclassOf<class UItemType> Type, bool bWrapAround);
	int32 GetSellValue(int32 Cost, float SellScalar);
	bool HasEquipmentSlot(class FName NameID);
	bool IsEquipped(TSubclassOf<class AItem> ItemBP);
	bool IsEquippedByID(const int32 ItemId);
	bool IsInventoryItemInfinite(const struct FInventoryItem& InventoryItem);
	bool IsInventoryItemInfiniteByID(class UInventoryComponent* Inventory, const int32 ItemId);
	bool IsInventoryItemInfiniteByType(TSubclassOf<class AItem> ItemBP);
	struct FInventoryResult K2_AddItem(TSubclassOf<class AItem> ItemBP, int32 Quantity, int32 ItemLevel, EItemNotifyReason Reason, bool bAllowAutoEquip);
	void K2_AddItemSoft(TSoftClassPtr<class UClass> ItemBP, int32 Quantity, int32 ItemLevel, EItemNotifyReason Reason, const TDelegate<void(const struct FInventoryResult& Result)>& OnAdded, bool ForceEquip, bool SendNotification);
	void MarkFavorited(const int32 ItemId, bool Favorited);
	void MarkNotNew(const int32 ItemId);
	void MulticastOnInventoryChanged();
	void NotifyPickupItem(TSubclassOf<class AItem> ItemBP, int32 Quantity, int32 Level, EItemNotifyReason Reason);
	void NotifyUsedItem(TSubclassOf<class AItem> ItemBP);
	void OnInstanceDataVisuallyChanged();
	void OnRep_Items();
	void PickupAndEquipItem(class AItem* Item, int32 SlotIndex, bool InHand);
	void PickupItem(class AItem* Item);
	void PutItemByID(class AActor* OtherActor, int32 ItemId, int32 Quantity);
	void RemoveAllItems();
	bool RemoveItem(TSoftClassPtr<class UClass> ItemBP, int32 Quantity, int32 ItemLevel);
	bool RemoveItemByID(int32 ID, int32 Quantity, int32 ItemLevel);
	void RouteNotifyPickupItem(TSubclassOf<class AItem> ItemBP, int32 Quantity, int32 Level, EItemNotifyReason Reason);
	void ServerDetachItem(int32 ItemId);
	void ServerDropItemByID(int32 ItemId, int32 Quantity, bool Force);
	void ServerEquipItemByID(int32 ItemId, int32 SlotIndex);
	void ServerEquipSkin(int32 ItemId, int32 SkinID);
	void ServerPickupAndEquipItem(class AItem* Item, int32 SlotIndex, bool InHand);
	void ServerPickupItem(class AItem* Item);
	void ServerPutItemByID(class AActor* OtherActor, int32 ItemId, int32 Quantity);
	void ServerSetActiveItem(TSubclassOf<class UItemType> Type);
	void ServerSetEquipmentInHand(TSubclassOf<class UItemType> Type);
	void ServerTakeAll(class AActor* OtherActor);
	void ServerTakeItemByID(class AActor* OtherActor, int32 ItemId, int32 Quantity);
	void ServerToggleActiveItem(TSubclassOf<class UItemType> Type);
	void ServerUnequipItemByID(int32 ItemId);
	void ServerUnequipMod(int32 ItemId, uint8 Slot, bool AddToInventory);
	void ServerUseItem(TSubclassOf<class AItem> ItemBP);
	void SetActiveItem(TSubclassOf<class UItemType> Type);
	void SetActiveItemByClass(TSubclassOf<class AEquipment> Equipment);
	void SetEquipmentInHand(TSubclassOf<class UItemType> Type);
	void SetEquipmentInHandByClass(TSubclassOf<class AEquipment> Equipment);
	void SetEquipmentInHandById(int32 EquipmentId);
	bool SetItemLevel(TSubclassOf<class AItem> ItemBP, int32 LevelToSet);
	bool SetQuantity(TSubclassOf<class AItem> ItemBP, int32 Quantity, int32 ItemLevel, EItemNotifyReason Reason);
	void SwapItem(TSubclassOf<class AItem> From, TSubclassOf<class AItem> To);
	void TakeAll(class AActor* OtherActor);
	void TakeItemByID(class AActor* OtherActor, int32 ItemId, int32 Quantity, int32 LevelOverride);
	void ToggleActiveItem(TSubclassOf<class UItemType> Type);
	bool UnequipItem(TSubclassOf<class AItem> ItemBP);
